package sample;

public class TernaryEx {
  public static void main(String[] args) {
    int x = 1;
    int y;
    y = (x == 1)? 10 : 20;
    System.out.println("y = " + y);

    //    임시  변동 주석입니다.
    //    임시  변동 주석입니다.
    //    임시  변동 주석입니다.
    //    임시  변동 주석입니다.
    //    임시  변동 주석입니다.
    //    임시  변동 주석입니다.
    //    임시  변동 주석입니다.
    //    임시  변동 주석입니다.
    //    임시  변동 주석입니다.
    //    임시  변동 주석입니다.
    //    임시  변동 주석입니다.
    //    임시  변동 주석입니다.
    //    임시  변동 주석입니다.
    //    임시  변동 주석입니다.
    //    임시  변동 주석입니다.
    //    임시  변동 주석입니다.
    //    임시  변동 주석입니다.
    //    임시  변동 주석입니다.
    //    임시  변동 주석입니다.
    //    임시  변동 주석입니다.
    //    임시  변동 주석입니다.
    //    임시  변동 주석입니다.
    //    임시  변동 주석입니다.
    //    임시  변동 주석입니다.
    //    임시  변동 주석입니다.
    //    임시  변동 주석입니다.
    //    임시  변동 주석입니다.
    //    임시  변동 주석입니다.
    //    임시  변동 주석입니다.
    //    임시  변동 주석입니다.
    //    임시  변동 주석입니다.
    //    임시  변동 주석입니다.
    //    임시  변동 주석입니다.
    //    임시  변동 주석입니다.
    //    임시  변동 주석입니다.
    //    임시  변동 주석입니다.
    //    임시  변동 주석입니다.
    //    임시  변동 주석입니다.
  }
}